src/templates/DaneSzukajPodmioty.ts

export const DaneSzukajPodmioty = (params: {
  nip?: string
  regon?: string
  krs?: string
}) => `
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ns="http://CIS/BIR/PUBL/2014/07" xmlns:dat="http://CIS/BIR/PUBL/2014/07/DataContract">
  <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <wsa:To>https://wyszukiwarkaregontest.stat.gov.pl/wsBIR/UslugaBIRzewnPubl.svc</wsa:To>
    <wsa:Action>http://CIS/BIR/PUBL/2014/07/IUslugaBIRzewnPubl/DaneSzukajPodmioty</wsa:Action>
  </soap:Header>
  <soap:Body>
    <ns:DaneSzukajPodmioty>
      <ns:pParametryWyszukiwania>
        ${params.nip ? `<dat:Nip>${params.nip}</dat:Nip>` : ''}
        ${params.regon ? `<dat:Regon>${params.regon}</dat:Regon>` : ''}
        ${params.krs ? `<dat:Krs>${params.krs}</dat:Krs>` : ''}
      </ns:pParametryWyszukiwania>
    </ns:DaneSzukajPodmioty>
  </soap:Body>
</soap:Envelope>
`
